Repository: KiYouJyo/UrbanPlanToolbox
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_cn

# Notification_Test_Failed
source: Windows could not send the test notification: {0}
ja_jp: Windows がテスト通知を送信できませんでした: {0}
zh_cn: Windows 未能发送测试通知：{0}

# Tool_ColorPaletteRecorder_Name
source: Color Palette Recorder
ja_jp: 配色パレット記録
zh_cn: 色卡方案记录器

# Tool_ColorPaletteRecorder_Description
source: Record project reference images, color families, and reusable color palettes locally.
ja_jp: プロジェクト画像、配色分類、再利用可能な色をローカルで記録します。
zh_cn: 离线记录项目原图、色系分类和可复用配色方案。

# Tool_ColorPaletteRecorder_Keywords
source: color palette scheme HEX RGB swatch reference image
ja_jp: 配色 パレット カラー HEX RGB 色見本 参照画像
zh_cn: 色卡 配色 方案 HEX RGB 色块 项目原图

# Palette_New
source: New color palette
ja_jp: 配色を新規作成
zh_cn: 新建配色方案

# Palette_NewScheme
source: Untitled palette
ja_jp: 名称未設定の配色
zh_cn: 未命名方案

# Palette_AllCategories
source: All color families
ja_jp: すべての色系統
zh_cn: 全部色系

# Palette_CategoryWarm
source: Warm
ja_jp: 暖色
zh_cn: 暖色系

# Palette_CategoryCool
source: Cool
ja_jp: 寒色
zh_cn: 冷色系

# Palette_CategoryNeutral
source: Neutral
ja_jp: 中間色
zh_cn: 中性色

# Palette_CategoryMonochrome
source: Black, white and gray
ja_jp: 白黒グレー
zh_cn: 黑白灰

# Palette_CategoryMixed
source: Mixed
ja_jp: 多色混合
zh_cn: 多色混合

# Palette_CategoryCustom
source: Custom
ja_jp: カスタム
zh_cn: 自定义

source: Palette name
ja_jp: 配色名
zh_cn: 方案名称

# Palette_CustomCategory
source: Custom color family
ja_jp: カスタム色系統
zh_cn: 自定义色系名称

# Palette_Images
source: Project reference images
ja_jp: プロジェクト参照画像
zh_cn: 项目原图

# Palette_Colors
source: Colors
ja_jp: 色
zh_cn: 具体颜色

# Palette_AddImages
source: Add images
ja_jp: 画像を追加
zh_cn: 添加图片

# Palette_AddColor
source: Add color
ja_jp: 色を追加
zh_cn: 新增颜色

# Palette_ColorRole
source: Color role
ja_jp: 色の用途
zh_cn: 颜色类型

# Palette_ColorRolePlaceholder
source: For example: Primary, secondary, accent
ja_jp: 例：メインカラー、補助色、アクセントカラー
zh_cn: 例如：主色、辅助色、强调色

# Palette_InvalidHex
source: Enter a valid #RRGGBB value.
ja_jp: 有効な #RRGGBB 値を入力してください。
zh_cn: 请输入有效的 #RRGGBB 值。

# Palette_ImageCount
source: {0} images
ja_jp: {0} 枚の画像
zh_cn: {0} 张图片

# Palette_ColorCount
source: {0} colors
ja_jp: {0} 色
zh_cn: {0} 种颜色

# Palette_Empty
source: No color palettes yet. Create one to begin recording a project scheme.
ja_jp: 配色はまだありません。プロジェクト配色を記録するには新規作成してください。
zh_cn: 还没有配色方案。新建一个方案以记录项目配色。

# Palette_ImageMissing
source: Reference image is missing or unavailable.
ja_jp: 参照画像が見つからないか利用できません。
zh_cn: 项目原图缺失或不可用。

# Palette_ImageImportFailed
source: One image could not be imported; other selected images remain available.
ja_jp: 一部の画像を読み込めませんでした。他の選択済み画像は保持されます。
zh_cn: 有一张图片无法导入；其他已选择图片不受影响。

# Palette_Save
source: Save changes
ja_jp: 変更を保存
zh_cn: 保存修改

# Palette_Reset
source: Reset unsaved changes
ja_jp: 未保存の変更をリセット
zh_cn: 重置未保存修改

# Palette_Edit
source: Edit
ja_jp: 編集
zh_cn: 编辑

source: Palette saved.
ja_jp: 配色を保存しました。
zh_cn: 方案已保存。

# Palette_SaveFailed
source: The palette could not be saved.
ja_jp: 配色を保存できませんでした。
zh_cn: 无法保存配色方案。

# Palette_LoadFailed
source: The color palettes could not be loaded safely.
ja_jp: 配色を安全に読み込めませんでした。
zh_cn: 无法安全读取配色方案。

# Palette_DeleteTitle
source: Delete color palette?
ja_jp: 配色を削除しますか？
zh_cn: 删除配色方案？

# Palette_DeleteMessage
source: This deletes the palette and its managed image copies. Original files are never changed.
ja_jp: 配色とアプリ管理の画像コピーを削除します。元ファイルは変更されません。
zh_cn: 这会删除方案及其应用管理的图片副本，绝不会修改原始文件。

# Palette_UnsavedTitle
source: Discard unsaved changes?
ja_jp: 未保存の変更を破棄しますか？
zh_cn: 放弃未保存的修改？

# Palette_UnsavedMessage
source: Your changes have not been saved.
ja_jp: 変更はまだ保存されていません。
zh_cn: 当前修改尚未保存。

# Palette_NoColorRole
source: No role specified
ja_jp: 用途未指定
zh_cn: 未指定类型

# Palette_EditColor
source: Edit color
ja_jp: 色を編集
zh_cn: 编辑颜色

# Tool_WorkflowReviewChecklist_Name
source: Workflow Review Checklist
ja_jp: ワークフローレビューチェックリスト
zh_cn: 流程审核清单

# Workflow_Description
source: Description
ja_jp: 説明
zh_cn: 清单说明

# Workflow_Usage
source: Usage
ja_jp: 用途
zh_cn: 用途类型

# Tool_WorkflowReviewChecklist_Description
source: Create, reuse, and run ordered design or research workflow checks entirely offline.
ja_jp: 設計または研究の手順を作成、再利用、確認するオフラインツールです。
zh_cn: 用于离线创建、复用和执行有序的设计或科研流程检查。

# Tool_WorkflowReviewChecklist_Keywords
source: workflow review checklist inspection design research audit
ja_jp: ワークフロー レビュー チェックリスト 設計 研究 確認
zh_cn: 流程 审核 检查 清单 设计检查 科研检查

# Workflow_New
source: New checklist
ja_jp: 新しいチェックリスト
zh_cn: 新建清单

# Workflow_Name
source: Checklist name
ja_jp: チェックリスト名
zh_cn: 清单名称

# Workflow_Create
source: Create
ja_jp: 作成
zh_cn: 创建

# Workflow_Empty
source: No workflow checklists yet.
ja_jp: チェックリストはまだありません。
zh_cn: 还没有流程审核清单。

# Workflow_Design
source: Design
ja_jp: 設計
zh_cn: 设计

# Workflow_Research
source: Research
ja_jp: 研究
zh_cn: 科研

# Workflow_General
source: General
ja_jp: 一般
zh_cn: 通用

# Workflow_Statistics
source: Total {0}; pending {1}; passed {2}; needs revision {3}; not applicable {4}; completion {5}%
ja_jp: 合計 {0}、未確認 {1}、合格 {2}、要修正 {3}、対象外 {4}、完了率 {5}%
zh_cn: 总计 {0}；未审核 {1}；通过 {2}；需修改 {3}；不适用 {4}；完成率 {5}%

# Workflow_AddSection
source: Add stage
ja_jp: 段階を追加
zh_cn: 新增流程阶段

# Workflow_AddItem
source: Add review item
ja_jp: 確認項目を追加
zh_cn: 新增审核项

# Workflow_SectionTitle
source: Stage title
ja_jp: 段階名
zh_cn: 阶段名称

# Workflow_ItemTitle
source: Review item
ja_jp: 確認項目
zh_cn: 审核项内容

# Workflow_Note
source: Review note
ja_jp: 確認メモ
zh_cn: 审核备注

# Workflow_Save
source: Save changes
ja_jp: 変更を保存
zh_cn: 保存修改

# Workflow_Reset
source: Reset unsaved changes
ja_jp: 未保存の変更を戻す
zh_cn: 重置未保存修改

# Workflow_Copy
source: Copy checklist
ja_jp: チェックリストを複製
zh_cn: 复制清单

# Workflow_Delete
source: Delete checklist
ja_jp: チェックリストを削除
zh_cn: 删除清单

# Workflow_DeleteMessage
source: This checklist and its review data will be deleted.
ja_jp: このチェックリストと確認データを削除します。
zh_cn: 将删除此清单及其审核数据。

# Workflow_Saved
source: Checklist saved.
ja_jp: チェックリストを保存しました。
zh_cn: 清单已保存。

# Workflow_SaveFailed
source: The checklist could not be saved safely.
ja_jp: チェックリストを安全に保存できませんでした。
zh_cn: 清单未能安全保存。

# Workflow_Pending
source: Pending review
ja_jp: 未確認
zh_cn: 未审核

# Workflow_Passed
source: Passed
ja_jp: 合格
zh_cn: 通过

# Workflow_NeedsRevision
source: Needs revision
ja_jp: 要修正
zh_cn: 需修改

# Workflow_NotApplicable
source: Not applicable
ja_jp: 対象外
zh_cn: 不适用

# Tool_RegulationsIndex_Name
source: Architecture & Planning Regulations Index
ja_jp: 建築・都市計画法規索引
zh_cn: 行业法规索引库

# Tool_RegulationsIndex_Description
source: Offline research catalog of official architecture and planning regulation sources and portals.
ja_jp: 建築・都市計画に関する公式法規情報と公式入口のオフライン研究カタログ。
zh_cn: 离线整理建筑与规划法规及官方入口的研究索引。

# Tool_RegulationsIndex_Keywords
source: regulations law code architecture planning China Japan United States US Europe EU official portal
ja_jp: 法規 法律 建築 都市計画 中国 日本 米国 欧州 EU 公式
zh_cn: 法规 法律 规范 建筑法规 规划法规 中国 日本 美国 欧盟 官方入口

# Regulations_Favorite
source: Favorite
ja_jp: お気に入り
zh_cn: 收藏

# Regulations_RegulationsHeader
source: Regulations
ja_jp: 法規
zh_cn: 法规条目

# Regulations_SearchPlaceholder
source: Search title, scope, topic, or keyword
ja_jp: 名称、範囲、テーマ、キーワードを検索
zh_cn: 搜索名称、范围、专题或关键词

# Regulations_LoadFailed
source: The regulations catalog could not be loaded. The packaged data may be unavailable.
ja_jp: 法規カタログを読み込めませんでした。パッケージデータを確認してください。
zh_cn: 法规索引库加载失败，请检查已安装包内的数据。

# Regulations_Stats
source: {0} entries: China {1}, Japan {2}, US {3}, EU/Europe {4}
ja_jp: {0}件：中国 {1}、日本 {2}、米国 {3}、EU/欧州 {4}
zh_cn: 共 {0} 条： 中国 {1}、日本 {2}、美国 {3}、欧盟/欧洲 {4}

# Regulations_Notice
source: Source verified {0}. Research index only; confirm current official text and local adoption before use.
ja_jp: 出典確認日 {0}。研究用索引であり、利用前に公式の現行本文と地域の採用状況を確認してください。
zh_cn: 数据核验日期：{0}。仅供研究索引使用，使用前请以官方现行文本及地方采用情况为准。

# Regulations_AllRegions
source: All regions
ja_jp: 全地域
zh_cn: 全部地区

# Regulations_AllTopics
source: All topics
ja_jp: 全テーマ
zh_cn: 全部专题

# Regulations_OfficialPortals
source: Official portals
ja_jp: 公式入口
zh_cn: 官方入口

# Regulations_FieldNotes
source: Data notes and limitations
ja_jp: データ注記と制限
zh_cn: 数据说明与边界

# Regulations_OpenOfficial
source: Open official website
ja_jp: 公式サイトを開く
zh_cn: 打开官网

# Regulations_OpenPdf
source: Open download or PDF
ja_jp: ダウンロードまたはPDFを開く
zh_cn: 打开下载或 PDF

# Regulations_LinkUnavailable
source: Link unavailable
ja_jp: リンクなし
zh_cn: 链接不可用

# Regulations_OpenFailed
source: Could not open the official link in the default browser.
ja_jp: 公式リンクを既定のブラウザーで開けませんでした。
zh_cn: 无法在默认浏览器中打开官方链接。

# Regulations_OriginalTitle
source: Original title
ja_jp: 原文タイトル
zh_cn: 文件原名

# Regulations_Identifier
source: Identifier or year
ja_jp: 番号または年
zh_cn: 编号或年份

# Regulations_Scope
source: Scope and purpose
ja_jp: 適用範囲と用途
zh_cn: 适用范围与用途

# Regulations_Effect
source: Effect or adoption
ja_jp: 効力または採用
zh_cn: 效力或采用方式

# Regulations_Verified
source: Verified
ja_jp: 確認日
zh_cn: 核验日期

# Regulations_CloseDetail
source: Close details
ja_jp: 詳細を閉じる
zh_cn: 关闭详情

# Tool_DesignConceptDictionary_Name
source: Design Concept Dictionary
ja_jp: 設計コンセプト辞典
zh_cn: 设计理念词典

# Tool_DesignConceptDictionary_Description
source: Record, search, and reuse design concepts and methods offline.
ja_jp: 設計理念や方法をオフラインで記録・検索・再利用します。
zh_cn: 离线记录、搜索和复用设计理念与方法。

# Tool_DesignConceptDictionary_Keywords
source: design concept design idea concept scheme development san sheng space design method
ja_jp: 設計理念 設計コンセプト 理念 コンセプト 案の推導 三生空間 設計手法
zh_cn: 设计理念 设计概念 理念 概念 方案推导 三生空间 设计方法

# Concept_New
source: New concept
ja_jp: 新しい理念
zh_cn: 新增理念

# Concept_SearchPlaceholder
source: Search name, definition, project type, tag, source, or note
ja_jp: 名称、定義、プロジェクト種別、タグ、出典、メモを検索
zh_cn: 搜索名称、定义、项目类型、标签、来源或备注

# Concept_ProjectTypeFilter
source: Project type
ja_jp: プロジェクト種別
zh_cn: 项目类型

# Concept_TagFilter
source: Tag
ja_jp: タグ
zh_cn: 标签

# Concept_AllProjectTypes
source: All project types
ja_jp: すべてのプロジェクト種別
zh_cn: 全部项目类型

# Concept_AllTags
source: All tags
ja_jp: すべてのタグ
zh_cn: 全部标签

# Concept_SortLastModified
source: Recently modified
ja_jp: 最近の更新
zh_cn: 最近修改

# Concept_SortCreated
source: Created
ja_jp: 作成日時
zh_cn: 创建时间

# Concept_SortName
source: Name
ja_jp: 理念名
zh_cn: 理念名称

# Concept_Count
source: Showing {0} of {1} concepts
ja_jp: {1} 件中 {0} 件を表示
zh_cn: 当前显示 {0} 条，共 {1} 条

# Concept_Empty
source: No concepts yet. This offline tool records your knowledge and does not create sample data automatically.
ja_jp: 理念はまだありません。サンプルを自動作成せず、オフラインで知識を記録します。
zh_cn: 还没有理念。这里用于离线记录设计知识，不会自动创建示例数据。

# Concept_LoadFailed
source: The design concept dictionary could not be loaded safely.
ja_jp: 設計コンセプト辞典を安全に読み込めませんでした。
zh_cn: 设计理念词典无法安全加载。

# Concept_LastModified
source: Last modified: {0}
ja_jp: 最終更新：{0}
zh_cn: 最后修改：{0}

source: Concept name
ja_jp: 理念名
zh_cn: 理念名称

# Concept_Definition
source: Definition
ja_jp: 理念の定義
zh_cn: 理念定义

# Concept_ProjectTypes
source: Applicable project types
ja_jp: 適用プロジェクト種別
zh_cn: 适用项目类型

# Concept_Tags
source: Keyword tags
ja_jp: キーワードタグ
zh_cn: 关键词标签

# Concept_Source
source: Source or reference
ja_jp: 出典または参考
zh_cn: 来源或参考

# Concept_Notes
source: Additional notes
ja_jp: 補足メモ
zh_cn: 补充说明

# Concept_Add
source: Add
ja_jp: 追加
zh_cn: 添加

# Concept_ProjectTypePlaceholder
source: Type a project type and press Enter
ja_jp: 種別を入力して Enter
zh_cn: 输入项目类型后按 Enter

# Concept_TagPlaceholder
source: Type a tag and press Enter
ja_jp: タグを入力して Enter
zh_cn: 输入标签后按 Enter

# Concept_Save
source: Save changes
ja_jp: 変更を保存
zh_cn: 保存修改

# Concept_Reset
source: Reset unsaved changes
ja_jp: 未保存の変更をリセット
zh_cn: 重置未保存修改

# Concept_Copy
source: Copy concept
ja_jp: 理念を複製
zh_cn: 复制理念

# Concept_Delete
source: Delete concept
ja_jp: 理念を削除
zh_cn: 删除理念

# Concept_Timestamps
source: Created: {0}; last modified: {1}
ja_jp: 作成：{0}、最終更新：{1}
zh_cn: 创建：{0}；最后修改：{1}

source: Concept saved.
ja_jp: 理念を保存しました。
zh_cn: 理念已保存。

# Concept_Copied
source: Concept copy created.
ja_jp: 理念の複製を作成しました。
zh_cn: 理念副本已创建。

# Concept_SaveFailed
source: The concept could not be saved safely.
ja_jp: 理念を安全に保存できませんでした。
zh_cn: 理念无法安全保存。

# Concept_DeleteFailed
source: The concept could not be deleted safely.
ja_jp: 理念を安全に削除できませんでした。
zh_cn: 理念无法安全删除。

# Concept_NameRequired
source: A concept name is required.
ja_jp: 理念名を入力してください。
zh_cn: 理念名称不能为空。

# Concept_DefinitionRequired
source: A definition is required.
ja_jp: 定義を入力してください。
zh_cn: 理念定义不能为空。

# Concept_DeleteTitle
source: Delete concept?
ja_jp: 理念を削除しますか？
zh_cn: 删除理念？

# Concept_DeleteMessage
source: Delete “{0}”? Other concepts will not be affected.
ja_jp: 「{0}」を削除しますか？他の理念には影響しません。
zh_cn: 确定删除“{0}”吗？此操作不会影响其他理念。

# Concept_UnsavedTitle
source: Discard unsaved changes?
ja_jp: 未保存の変更を破棄しますか？
zh_cn: 放弃未保存的修改？

# Concept_UnsavedMessage
source: Your changes have not been saved.
ja_jp: 変更はまだ保存されていません。
zh_cn: 当前修改尚未保存。

# Concept_Discard
source: Discard changes
ja_jp: 変更を破棄
zh_cn: 放弃修改

# Concept_CopySuffix
source: copy
ja_jp: の複製
zh_cn: 副本

# About_Channel
source: Distribution channel: {0}
ja_jp: 配布チャンネル：{0}
zh_cn: 发行渠道：{0}

# About_OfflineFirst.Text
source: Offline-first: local features need no account or connection; update checks and external pages are opened only after your action.
ja_jp: オフライン優先：ローカル機能にアカウントや接続は不要です。更新確認と外部ページはユーザー操作時だけ行います。
zh_cn: 离线优先：本地功能无需账户或联网；更新检查和外部网页仅在你主动操作时访问。

# Action_Support
source: Help and support
ja_jp: ヘルプとサポート
zh_cn: 帮助与支持

# Action_Privacy
source: Privacy policy
ja_jp: プライバシーポリシー
zh_cn: 隐私政策

# Action_ThirdPartyNotices
source: Third-party notices and data sources
ja_jp: 第三者ライセンスとデータソース
zh_cn: 第三方许可与数据来源

# Action_CopyDiagnostics
source: Copy diagnostics
ja_jp: 診断情報をコピー
zh_cn: 复制诊断信息

# Diagnostics_Copied
source: Diagnostics copied. Review the content before sharing.
ja_jp: 診断情報をコピーしました。送信前に内容を確認してください。
zh_cn: 诊断信息已复制。提交前请再次检查内容。

# Error_OpenDocumentFailed
source: The offline document could not be read.
ja_jp: オフライン文書を読み込めません。
zh_cn: 无法读取离线文档。

# Update_StoreManaged
source: Updates for this version are managed by Microsoft Store.
ja_jp: このバージョンの更新は Microsoft Store が管理します。
zh_cn: 此版本由 Microsoft Store 管理更新。

# Update_StoreManagedNoProduct
source: Updates for this version are managed by Microsoft Store; Store product information is not configured.
ja_jp: このバージョンの更新は Microsoft Store が管理します。ストア製品情報は未設定です。
zh_cn: 此版本由 Microsoft Store 管理更新；商店产品信息尚未配置。

# Action_OpenStore
source: Open Microsoft Store
ja_jp: Microsoft Store を開く
zh_cn: 打开 Microsoft Store

# DataManagement_Clear
source: Clear local data
ja_jp: ローカルデータを消去
zh_cn: 清除本地数据

# DataManagement_ClearTitle
source: Clear local data?
ja_jp: ローカルデータを消去しますか？
zh_cn: 清除本地数据？

# DataManagement_ClearMessage
source: This removes app-managed projects, settings, favorites, tool data, attachments, backups, and logs. It does not remove external work folders you created.
ja_jp: アプリが管理するプロジェクト、設定、お気に入り、ツールデータ、添付ファイル、バックアップ、ログを消去します。ユーザーが作成した外部の作業フォルダーは消去しません。
zh_cn: 将删除应用管理的项目、设置、收藏、工具数据、附件、备份和日志；不会删除你自己创建的外部工作文件夹。

# DataManagement_ClearContinue
source: Continue to confirm
ja_jp: 続行して確認
zh_cn: 继续确认

# DataManagement_ClearConfirmTitle
source: Confirm clearing again
ja_jp: 消去を再確認
zh_cn: 再次确认清除

# DataManagement_ClearConfirmMessage
source: This cannot be undone. Restore the initial state?
ja_jp: この操作は元に戻せません。初期状態に戻しますか？
zh_cn: 此操作不可撤销。确定恢复为初始状态吗？

# DataManagement_ClearSuccess
source: Local data was cleared and the app returned to its initial state.
ja_jp: ローカルデータを消去し、初期状態に戻しました。
zh_cn: 本地数据已清除，应用已恢复为初始状态。

# DataManagement_ClearFailed
source: Local data could not be cleared completely; existing data was not intentionally overwritten.
ja_jp: ローカルデータを完全には消去できませんでした。既存データは上書きしていません。
zh_cn: 本地数据未能完整清除；现有数据未被主动覆盖。

# Tool_CoordinateSystemConverter_Name
source: Coordinate System Converter
ja_jp: 座標系変換ツール
zh_cn: 坐标系转换器

# Tool_CoordinateSystemConverter_Description
source: Convert WGS 84, GCJ-02, and BD-09 coordinates locally.
ja_jp: WGS 84、GCJ-02、BD-09 の座標を端末内で変換します。
zh_cn: 在本机转换 WGS 84、GCJ-02 和 BD-09 坐标。

# Tool_CoordinateSystemConverter_Keywords
source: coordinate GIS WGS84 GCJ-02 BD-09 shapefile
ja_jp: 座標 GIS WGS84 GCJ-02 BD-09 Shapefile
zh_cn: 坐标 GIS WGS84 GCJ-02 BD-09 Shapefile

# Coordinate_ModeSingle
source: Single point
ja_jp: 単一点変換
zh_cn: 单点转换

# Coordinate_ModeShapefile
source: Shapefile conversion
ja_jp: Shapefile変換
zh_cn: Shapefile转换

# Coordinate_Source
source: Source coordinate system
ja_jp: 変換元座標系
zh_cn: 源坐标系

# Coordinate_Target
source: Target coordinate system
ja_jp: 変換先座標系
zh_cn: 目标坐标系

# Coordinate_Longitude
source: Longitude
ja_jp: 経度
zh_cn: 经度

# Coordinate_Latitude
source: Latitude
ja_jp: 緯度
zh_cn: 纬度

# Coordinate_Swap
source: Swap source and target
ja_jp: 変換元/先を交換
zh_cn: 交换源/目标

# Coordinate_ActionConvert
source: Convert
ja_jp: 変換
zh_cn: 转换

# Coordinate_ActionClear
source: Clear
ja_jp: クリア
zh_cn: 清空

# Coordinate_ActionSample
source: Example
ja_jp: 例
zh_cn: 示例数据

# Coordinate_CopyLongitude
source: Copy longitude
ja_jp: 経度をコピー
zh_cn: 复制经度

# Coordinate_CopyLatitude
source: Copy latitude
ja_jp: 緯度をコピー
zh_cn: 复制纬度

# Coordinate_CopyCoordinate
source: Copy coordinate
ja_jp: 座標全体をコピー
zh_cn: 复制完整坐标

# Coordinate_InvalidInput
source: Enter finite longitude (-180 to 180) and latitude (-90 to 90).
ja_jp: 有限の経度（-180～180）と緯度（-90～90）を入力してください。
zh_cn: 请输入有限的经度（-180至180）和纬度（-90至90）。

# Coordinate_SameSystem
source: Source and target coordinate systems are the same.
ja_jp: 変換元と変換先の座標系が同じです。
zh_cn: 源坐标系与目标坐标系相同。

# Coordinate_OutsideArea
source: Outside the public approximation area; the original coordinate was retained.
ja_jp: 公開近似アルゴリズムの適用範囲外のため、元の座標を保持しました。
zh_cn: 坐标在公开近似算法适用范围外，已保留原坐标。

# Coordinate_ShapefileDescription
source: Shapefile batch conversion is processed locally and never uploads source files.
ja_jp: Shapefile の一括変換は端末内で処理され、元ファイルをアップロードしません。
zh_cn: Shapefile批量转换在本机处理，不会上传源文件。

# Coordinate_ShapefilePrivacy
source: Only geographic longitude/latitude source data is supported in this version.
ja_jp: このバージョンは地理的な経緯度の入力データのみ対応します。
zh_cn: 本版本只支持地理经纬度源数据。

# Coordinate_Disclaimer
source: Results use public approximation algorithms for ordinary map overlay, data preparation, and research support. Use qualified data and conversion services for surveying, approval, construction setting-out, or legal purposes.
ja_jp: 結果は公開近似アルゴリズムに基づき、一般的な地図重ね合わせ、データ整理、研究支援に限って利用できます。測量、承認、工事測設、法的用途では、資格を持つデータと変換サービスを利用してください。
zh_cn: 转换结果基于公开近似算法，仅适用于一般地图叠加、数据整理和研究辅助。对测绘、审批、工程放样或法律用途，请使用有资质的数据和转换服务。

# Shapefile_Select
source: Select Shapefile
ja_jp: Shapefile を選択
zh_cn: 选择 Shapefile

# Shapefile_OutputFolder
source: Select output folder
ja_jp: 出力フォルダーを選択
zh_cn: 选择输出文件夹

# Shapefile_OutputName
source: Output name
ja_jp: 出力名
zh_cn: 输出文件名

# Shapefile_Cancel
source: Cancel
ja_jp: キャンセル
zh_cn: 取消

# Shapefile_OpenOutput
source: Open output folder
ja_jp: 出力フォルダーを開く
zh_cn: 打开输出文件夹

# Shapefile_ChooseFirst
source: Select a Shapefile and output folder first.
ja_jp: 先に Shapefile と出力フォルダーを選択してください。
zh_cn: 请先选择 Shapefile 和输出文件夹。

# Shapefile_Completed
source: Completed
ja_jp: 完了
zh_cn: 已完成

# Shapefile_Progress
source: Features: {0}; vertices: {1}; warnings: {2}
ja_jp: 処理済みフィーチャ：{0}；頂点：{1}；警告：{2}
zh_cn: 已处理要素：{0}；已处理顶点：{1}；警告：{2}

# Coordinate_ResultTitle
source: Conversion result
ja_jp: 変換結果
zh_cn: 转换结果

# Shapefile_OutputNameHelp
source: Enter the base file name only. The app generates .shp, .shx, .dbf, .cpg, and applicable metadata files.
ja_jp: ベースファイル名のみ入力してください。対応する .shp、.shx、.dbf、.cpg、メタデータが生成されます。
zh_cn: 只需填写主文件名。应用将自动生成 .shp、.shx、.dbf、.cpg 和适用的元数据文件。

# Shapefile_InvalidName
source: Enter a valid base file name without a path.
ja_jp: パスを含まない有効なベースファイル名を入力してください。
zh_cn: 请输入不含路径的有效主文件名。

# Shapefile_SelectionHelp
source: Select the main .shp file and keep the matching companion files in the same folder: .dbf (required), .shx (recommended), and .prj / .cpg (optional).
ja_jp: メインの .shp ファイルを選択し、同じ名前の関連ファイルを同一フォルダーに配置してください： .dbf（必須）、.shx（推奨）、.prj と .cpg（任意）。
zh_cn: 请选择主 .shp 文件，并确保同名配套文件位于同一目录： .dbf（必需）、.shx（建议）、.prj 和 .cpg（可选）。

# Shapefile_CompanionStatusTitle
source: Companion files
ja_jp: 関連ファイル
zh_cn: 配套文件

# Shapefile_CompanionFound
source: ✓ {0}: Found
ja_jp: ✓ {0}：見つかりました
zh_cn: ✓ {0}：已找到

# Shapefile_CompanionMissing
source: ✕ {0}: Missing
ja_jp: ✕ {0}：不足
zh_cn: ✕ {0}：缺失

# Shapefile_CompanionRecommended
source: ! {0}: Recommended
ja_jp: ! {0}：補足を推奨
zh_cn: ! {0}：建议补充

# Shapefile_CompanionOptionalMissing
source: – {0}: Not provided (optional)
ja_jp: – {0}：任意ファイルは未提供
zh_cn: – {0}：可选文件未提供

# Shapefile_MissingDbf
source: The required .dbf file is missing; conversion is unavailable.
ja_jp: 必須の .dbf ファイルがないため、変換できません。
zh_cn: 缺少必需的 .dbf 文件，无法转换。

# Shapefile_MissingShx
source: The .shx file was not found. Adding it before conversion is recommended.
ja_jp: .shx ファイルが見つかりません。変換前に補足することを推奨します。
zh_cn: 未找到 .shx 文件，建议补充后再转换。

# Settings_AppearanceLanguageTitle
source: Appearance and language
ja_jp: 外観と言語
zh_cn: 外观与语言

# Settings_AppearanceLanguageDescription
source: Adjust the app theme and display language.
ja_jp: アプリのテーマと言語を調整します。
zh_cn: 调整应用主题和界面语言。

# Settings_ThemeDescription
source: Choose light, dark, or system theme. Theme changes take effect immediately.
ja_jp: ライト、ダーク、またはシステム設定に従うテーマを選択します。テーマの変更はすぐに反映されます。
zh_cn: 选择浅色、深色或跟随系统。主题更改立即生效。

# Settings_LanguageDescription
source: Choose the display language. Language changes take effect after the app restarts.
ja_jp: 表示言語を選択します。言語の変更はアプリの再起動後に反映されます。
zh_cn: 选择界面语言。语言更改将在重启应用后生效。

# Settings_AppearanceLanguageSummary
source: Theme changes take effect immediately; language changes require an app restart.
ja_jp: テーマの選択はすぐに反映され、言語の変更にはアプリの再起動が必要です。
zh_cn: 主题选择立即生效；语言更改需要重启应用。

# Settings_DisplayCalculationTitle
source: Display and calculation
ja_jp: 表示と計算
zh_cn: 显示与计算

# Settings_DisplayCalculationDescription
source: Adjust calculation-result display and automatic calculation behavior.
ja_jp: 計算結果の表示と自動計算の動作を調整します。
zh_cn: 调整计算结果显示和自动计算行为。

# Settings_DecimalDescription
source: Set the displayed decimal places for calculation results without changing raw values.
ja_jp: 元の計算値を変更せずに、結果の小数点以下の表示桁数を設定します。
zh_cn: 设置计算结果显示的小数位数，不改变原始计算值。

# Settings_AutoCalculateDescription
source: Automatically recalculate when input changes in supported tools.
ja_jp: 対応するツールで入力が変わると自動的に再計算します。
zh_cn: 在支持的工具中输入变化时自动重新计算。

# Settings_RestoreDefaultsTitle
source: Restore default settings
ja_jp: 既定の設定に戻す
zh_cn: 恢复默认设置

# Settings_RestoreDefaultsDescription
source: Restore the default theme, display precision, automatic calculation, and language choices.
ja_jp: テーマ、表示桁数、自動計算、言語を既定の選択に戻します。
zh_cn: 恢复主题、显示精度、自动计算和语言的默认选择。

# Settings_DataManagementDescription
source: Portable backups include projects, settings, favorites, tool data, and app-managed attachments. They do not include logs, caches, certificates, keys, or external work-folder contents.
ja_jp: ポータブルバックアップには、プロジェクト、設定、お気に入り、ツールデータ、アプリが管理する添付ファイルが含まれます。ログ、キャッシュ、証明書、鍵、外部作業フォルダーの内容は含まれません。
zh_cn: 便携备份包含项目、设置、收藏、工具数据和应用管理的附件，不包含日志、缓存、证书、密钥或外部工作文件夹内容。

# Setting_Language_RestartTitle
source: Restart app
ja_jp: アプリを再起動
zh_cn: 重启应用

# Setting_Language_RestartMessage
source: The language change will take effect after the app restarts. Restart now?
ja_jp: 言語の変更はアプリの再起動後に反映されます。今すぐ再起動しますか？
zh_cn: 语言更改将在重启应用后生效。是否立即重启？

# Setting_Language_RestartNow
source: Restart now
ja_jp: 今すぐ再起動
zh_cn: 立即重启

# Setting_Language_Later
source: Later
ja_jp: 後で
zh_cn: 稍后

# Setting_Language_SavedRestartHint
source: Saved. Takes effect after restart.
ja_jp: 保存しました。再起動後に反映されます。
zh_cn: 已保存，将在重启后生效。

# Setting_Language_RestartFailed
source: The app could not restart automatically. Your language setting has been saved. Close and reopen the app manually.
ja_jp: アプリを自動的に再起動できませんでした。言語設定は保存されています。アプリを手動で終了し、もう一度起動してください。
zh_cn: 无法自动重启应用。语言设置已保存，请手动关闭并重新打开应用。

# Settings_ThemeLabel
source: Theme
ja_jp: テーマ
zh_cn: 主题

# Settings_LanguageLabel
source: Language
ja_jp: 言語
zh_cn: 语言

# Settings_DecimalLabel
source: Decimal places for calculation results
ja_jp: 計算結果の小数点以下の表示桁数
zh_cn: 计算结果保留小数位

# Settings_AutoCalculateLabel
source: Automatically recalculate when input changes
ja_jp: 入力変更時に自動的に再計算
zh_cn: 输入变化时自动重新计算

# Settings_DataManagementTitle
source: Data management
ja_jp: データ管理
zh_cn: 数据管理
